CppProgrammer23/STM32Projects/STM32F413H_Disco/DHT11/Core/Src/main.c
}

DHT11 DHT11_ReadValues()
{
	DHT11 dht11;
	char hum[6];
	char temp[6];
	uint8_t h1=readDataDHT11();
	uint8_t h2=readDataDHT11();
	uint8_t t1=readDataDHT11();
	uint8_t t2=readDataDHT11();
	checkParity+=(h1+h2);
	checkParity+=(t1+t2);
	sprintf(hum,"%i.%i%%",h1,h2);
	sprintf(temp,"%i.%iC",t1,t2);
	BSP_LCD_DisplayStringAt(20, 120, (uint8_t*)hum, CENTER_MODE);
	BSP_LCD_DisplayStringAt(20, 90, (uint8_t*)temp, CENTER_MODE);
	dht11.humidity=atoff(hum);
	dht11.temperature=atoff(temp);
	return dht11;
}
uint8_t checkP(void)
{
	return readDataDHT11();
}
float FromCelcuisToFahr(float t)
{
	return t*1.8 + 32;
}
float FromFahrToCelsuis(float t)
{
	return (t-32)/1.8;
}

void LCD_Init(void)
{
	BSP_LCD_InitEx(LCD_ORIENTATION_LANDSCAPE_ROT180);
	BSP_LCD_Clear(LCD_COLOR_WHITE);
	BSP_LCD_SetFont(&Font12);
}
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
	BSP_LCD_Clear(LCD_COLOR_WHITE);
	DHT11_Init();
	DHT11_ReadValues();
	if(checkParity==checkP())
		BSP_LCD_DisplayStringAt(20, 150, (uint8_t*)"Data are correct", CENTER_MODE);
	else
		BSP_LCD_DisplayStringAt(20, 150, (uint8_t*)"Data are not correct", CENTER_MODE);
}
/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
